def calculateYear(date):
    day, month, year = date.split('.');
    print(day + " " + month + " " + year)

    result = calculateSumOfDigits(day) + calculateSumOfDigits(month) + calculateSumOfDigits(year)

    while(result >=10):
        result = calculateSumOfDigits(result)

    return result

def calculateSumOfDigits(number):
    sum = 0
    if(type(number) is str):
        for element in range(0, len(number)):
            sum += int(number[element])
    elif(type(number) is int):
        while(number > 0):
            sum += number % 10
            number = (number // 10)
    return sum

if __name__ == '__main__':
    a = input("Enter: ");
    number = calculateYear(a)
    print(number)
    messages = ["""Да се научим да поемаме отговорност и преодоляваме трудностите чрез разум.
                Самостоятелен бизнес, търговски представител, програмист.""",
                """Да се научим да работим в колектив. Професии в областта на
                 медицината, биологията, химията, археологията.""",
                """Да се научим да ценим и малките успехи в живота. Професии свързани с пътуване, туризъм,
                усъвършенстване на технологии, търговия.""",
                """Да се научим на прецизност в професията. Професии свързани с
                конструиране, техника, строг ред и дисциплина, спорт.""",
                """Да се научим да комуникираме с другите. Професии свързани с
                преподаване, научна и административна дейност, журналистика и реклама.""",
                """Да се научим на безкористност, човеколюбие, безпристрастност. Професии свързани с
                изкуство, дизайн, художествена гимнастика, поезия, психология.""",
                """Да се научим да анализираме. Професии свързани с точна изработка – гравьор, скулптор, градинар, хирург.""",
                """Да се научим на взискателност, целеустременост, постоянство.
                Професии свързани с риск – криминалист, съдебен медик, траурен агент, банкер, медиум.""",
                """Да се научим на състрадание, толерантност, благотворителност. Професии свързани с нетрадиционно мислене
                 чрез духовно израстване – пионери във всяка една област,
                хора, които променят разбиранията ни за света и човечеството."""]

    print(messages[number - 1])
