import sys


class Graph():

    def __init__(self, vertices):
        self.V = vertices
        # Инициализация на матрицата на графа
        self.graph = [[0 for column in range(vertices)]
                      for row in range(vertices)]

    def printSolution(self, dist):
        # Извеждане на най-късите разстояния от начален връх до всеки друг връх
        for node in range(self.V):
            print(node, "\t", dist[node])  # С табулация

    def minDistance(self, dist, sptSet):
        # Намиране на върха с най-малко разстояние, който не е включен в най-кратък път до момента
        min = sys.maxsize  # представлява безкрайно голямо число
        # Използва се за начална стойност в алгоритъма за най-малко разстояние, преди да бъдат намерени по-малки стойности
        # Нашата безкрайност

        # Цикъл за търсене на върха, който е най-близък до нашия и все още не е включен в кратък път
        for u in range(self.V):
            if dist[u] < min and sptSet[u] == False:
                min = dist[u]
                min_index = u

        return min_index  # връщаме го

    def dijkstra(self, src):
        dist = [sys.maxsize] * self.V  # максималната стойност V на брой пъти, т.е за всеки връх разстоянието е безкрайност
        dist[src] = 0  # брояч
        sptSet = [False] * self.V  # първоначално всички върхове не са посетени - False V на брой пъти [False,.....,False]

        for i in range(self.V):
            # Избиране на върха с минималното ни разстояние от всичките върхове, които все още не са посетени
            # х винаги е върха с минималното разстояние от първата ни итерация
            x = self.minDistance(dist, sptSet)

            # Поставяме върха с минималното разстояние в най-краткия път - Казваме, че вече е посетен
            sptSet[x] = True

            # Актуализираме стойността на разстоянието на съседните върхове на нашия начален връх
            # само ако текущото разстояние е по-голямо от новото и върхът не е посетен (не е включен в най-кратък път)
            for y in range(self.V):
                if self.graph[x][y] > 0 and sptSet[y] == False and \
                        dist[y] > dist[x] + self.graph[x][y]:  # От началния ни връх събирам всики разстояния до нашия връх
                    dist[y] = dist[x] + self.graph[x][y]

        self.printSolution(dist)  # Извикваме принт функцията, за да ни изведе най-късото разстояние


if __name__ == "__main__": # Примерен граф
    g = Graph(9)
    g.graph = [[0, 4, 0, 0, 0, 0, 0, 8, 0],
               [4, 0, 8, 0, 0, 0, 0, 11, 0],
               [0, 8, 0, 7, 0, 4, 0, 0, 2],
               [0, 0, 7, 0, 9, 14, 0, 0, 0],
               [0, 0, 0, 9, 0, 10, 0, 0, 0],
               [0, 0, 4, 14, 10, 0, 2, 0, 0],
               [0, 0, 0, 0, 0, 2, 0, 1, 6],
               [8, 11, 0, 0, 0, 0, 1, 0, 7],
               [0, 0, 2, 0, 0, 0, 6, 7, 0]
               ]

    g.dijkstra(0)
